In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk ={"istanbul" : [10,20,np.nan],"ankara" : [30,np.nan,40],"izmir" : [50,60,70]}
havadframe = pd.DataFrame(sozluk)

In [3]:
havadframe

   istanbul  ankara  izmir
0      10.0    30.0     50
1      20.0     NaN     60
2       NaN    40.0     70

In [4]:
havadframe.dropna()

   istanbul  ankara  izmir
0      10.0    30.0     50

In [5]:
havadframe

   istanbul  ankara  izmir
0      10.0    30.0     50
1      20.0     NaN     60
2       NaN    40.0     70

In [6]:
havadframe.dropna (axis =1)

   izmir
0     50
1     60
2     70

In [7]:
sozluk2 ={"istanbul" : [10,20,np.nan],"ankara" : [30,np.nan,40],"izmir" : [50,60,70],"antalya" : [45,np.nan,np.nan]}
havadframe2 = pd.DataFrame(sozluk2)

In [8]:
havadframe2

   istanbul  ankara  izmir  antalya
0      10.0    30.0     50     45.0
1      20.0     NaN     60      NaN
2       NaN    40.0     70      NaN

In [12]:
havadframe2.dropna(axis=1,thresh=2)

   istanbul  ankara  izmir
0      10.0    30.0     50
1      20.0     NaN     60
2       NaN    40.0     70

In [13]:
havadframe2

   istanbul  ankara  izmir  antalya
0      10.0    30.0     50     45.0
1      20.0     NaN     60      NaN
2       NaN    40.0     70      NaN

In [14]:
havadframe2.fillna(99)

   istanbul  ankara  izmir  antalya
0      10.0    30.0     50     45.0
1      20.0    99.0     60     99.0
2      99.0    40.0     70     99.0

In [17]:
## groupby

In [36]:
maassozluk = {"departman" : ["yazilim","yazilim","pazarlama","pazarlama","finans","finans"],
              "calisan ismi" : ["ahmet","mehmet","ezel","cengiz","eysan","kerpeten ali"],
              "maas" : [100,203,345,745,241,123]
             }

In [37]:
maasdata = pd.DataFrame(maassozluk)

In [38]:
maasdata

   departman  calisan ismi  maas
0    yazilim         ahmet   100
1    yazilim        mehmet   203
2  pazarlama          ezel   345
3  pazarlama        cengiz   745
4     finans         eysan   241
5     finans  kerpeten ali   123

In [39]:
gruplar=maasdata.groupby("departman")

In [40]:
gruplar.count()

           calisan ismi  maas
departman
finans                2     2
pazarlama             2     2
yazilim               2     2

In [41]:
gruplar.mean()

            maas
departman
finans     182.0
pazarlama  545.0
yazilim    151.5

In [42]:
gruplar.min()

          calisan ismi  maas
departman
finans           eysan   123
pazarlama       cengiz   345
yazilim          ahmet   100

In [43]:
gruplar.max()

           calisan ismi  maas
departman
finans     kerpeten ali   241
pazarlama          ezel   745
yazilim          mehmet   203

In [44]:
gruplar.describe()

           maas
          count   mean         std    min     25%    50%     75%    max
departman
finans      2.0  182.0   83.438600  123.0  152.50  182.0  211.50  241.0
pazarlama   2.0  545.0  282.842712  345.0  445.00  545.0  645.00  745.0
yazilim     2.0  151.5   72.831998  100.0  125.75  151.5  177.25  203.0